# Insert Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
VertexIndexPairArray..::..Insert Method
VertexIndexPairArray Class See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Insert(
	VertexIndexPair item,
	int index
)
```

Visual Basic
---
```text
Public Overridable Sub Insert ( _
	item As VertexIndexPair, _
	index As Integer _
)
```

Visual C++
---
```text
public:
virtual void Insert(
	VertexIndexPair^ item,
	int index
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..VertexIndexPair
index
    Type: System..::..Int32
# See Also
VertexIndexPairArray Class
Autodesk.Revit.DB Namespace